#! /usr/bin/env python
#coding=utf-8

cate_list = [u'科技', u'生活', u'医疗', '文学', u'教育', u'旅行', u'新闻', u'娱乐', u'艺术', u'人物']

user_list = ['fz','dc','wl','zmy']

user_score = {'fz': 30, 'dc': 25, 'wl':20, 'zmy':'30'}

user_arch= {
'fz': {u'在线时长半小时': 5, u'答对5个题': 10, u'挑战胜利5次': 5, u'挑战胜利10次':10},
'dc': {u'阅读30分钟': 5, u'答对5个题': 10, u'在线时长满1小时':10},
'wl': {u'阅读5条': 5, u'在线时长满1小时':10, u'好友数满5': 5},
'zmy': {u'阅读5条': 5,u'阅读10条':10, u'答对5个题': 5, u'答对10个题': 10},
}

user_follow = {
'fz': ['dc', 'wl', 'zmy'],
'dc': ['fz', 'wl'],
'wl': ['fz', 'dc'],
'zmy': ['dc', 'wl', 'fz'],
}

user_history = {
'fz': [u'阿司匹林',u'青霉素',u'水浒传',u'黄山'],
'dc': [u'阿司匹林',u'青霉素',u'水浒传'],
'wl': [u'阿司匹林',u'青霉素',u'水浒传',u'手机',u'葡萄'],
'zmy': [u'阿司匹林',u'青霉素',u'水浒传',u'密歇根湖',u'吴道元',u'维克多·雨果',u'五月天',u'葡萄',u'送子天王图',u'吴道元',u'莫扎特',u'五月天']
}
